GAULAvionique2024-2025/Ordinateur-de-bord/ODB_V3/Software/STM32CubeIDE/ODBlix/Core/Src/GAUL_Drivers/bno055.c
#include <GAUL_Drivers/bno055.h>
#include <stdint.h>
#include <stdio.h>
#include <stm32f4xx.h>

#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_def.h"
#include "stm32f4xx_hal_i2c.h"

/**
 * Initialize the Bosch BNO055 Sensor
 * ---------------------------------------------------------------
 *
 *  Initializes the Bosch BNO055 Sensor with
 *  the specified operation mode.
 * ---------------------------------------------------------------
 *
 *  Args:
 *  > `imu[bno055_t*]`: pointer to the structure to initialize
 * ---------------------------------------------------------------
 *
 *  Return:
 *  > `bool`: `true` if none of the init steps fail, `false` else
 * ---------------------------------------------------------------
 */
error_bno bno055_init(bno055_t* imu) {
    uint8_t id = 0;
    error_bno err;

    imu->addr = (imu->addr << 1);
    err = bno055_read_regs(*imu, BNO_CHIP_ID, &id, 1);
    if (err != BNO_OK) {
        return err;
    }
    if (id != BNO_DEF_CHIP_ID) {
        return BNO_ERR_WRONG_CHIP_ID;
    }
    if ((err = bno055_set_opmode(imu, BNO_MODE_CONFIG)) != BNO_OK) {
        return err;
    }
    HAL_Delay(2);
    bno055_reset(imu);
    HAL_Delay(5000);
    if ((err = bno055_set_pwr_mode(imu, BNO_PWR_NORMAL)) != BNO_OK) {
        return err;
    }
    HAL_Delay(10);
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
    HAL_Delay(BNO_CONFIG_TIME_DELAY + 5);
    bno055_on(imu);
    if ((err = bno055_set_opmode(imu, imu->mode)) != BNO_OK) {
        return err;
    }
    HAL_Delay(BNO_ANY_TIME_DELAY + 5);

    imu->temperature = &bno055_temperature;
    imu->acc_x = &bno055_acc_x;
    imu->acc_y = &bno055_acc_y;
    imu->acc_z = &bno055_acc_z;
    imu->acc = &bno055_acc;
    imu->linear_acc_x = &bno055_linear_acc_x;
    imu->linear_acc_y = &bno055_linear_acc_y;
    imu->linear_acc_z = &bno055_linear_acc_z;
    imu->linear_acc = &bno055_linear_acc;
    imu->gyro_x = &bno055_gyro_x;
    imu->gyro_y = &bno055_gyro_y;
    imu->gyro_z = &bno055_gyro_z;
    imu->gyro = &bno055_gyro;
    imu->mag_x = &bno055_mag_x;
    imu->mag_y = &bno055_mag_y;
    imu->mag_z = &bno055_mag_z;
    imu->mag = &bno055_mag;
    imu->gravity_x = &bno055_gravity_x;
    imu->gravity_y = &bno055_gravity_y;
    imu->gravity_z = &bno055_gravity_z;
    imu->gravity = &bno055_gravity;
    imu->euler_yaw = &bno055_euler_yaw;
    imu->euler_roll = &bno055_euler_roll;
    imu->euler_pitch = &bno055_euler_pitch;
    imu->euler = &bno055_euler;
    imu->quaternion_w = &bno055_quaternion_w;
    imu->quaternion_x = &bno055_quaternion_x;
    imu->quaternion_y = &bno055_quaternion_y;
    imu->quaternion_z = &bno055_quaternion_z;
    imu->quaternion = &bno055_quaternion;

    imu->acc_config = &bno055_acc_conf;
    imu->gyr_config = &bno055_gyr_conf;
    imu->mag_config = &bno055_mag_conf;
    return BNO_OK;
}

/**
 * Bosch BNO055 read temperature function
 * ----------------------------------------------------------------------
 *
 * Read the temperature of the Bosch BNO055 Sensor and store it in a
 * specified buffer.
 * Unit can be specified with `bno055_set_unit(...)`. (Default: Celsius)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the temperature from
 *     > `buf[int8_t*|int8_t*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, `BNO_ERR_X` else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_temperature(bno055_t* imu, int8_t* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data = 0;
    if ((err = bno055_read_regs(*imu, BNO_TEMP, &data, 1)) != BNO_OK) {
        return err;
    }
    *buf = (imu->_temp_unit) ? data * 2 : data;
    return BNO_OK;
}

/**
 * Bosch BNO055 read accelerometer data on X-axis
 * ----------------------------------------------------------------------
 *
 * Reads the accelerometer data and stores the value in the specified buffer.
 * Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[float*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_acc_x(bno055_t* imu, float* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[2];
    if ((err = bno055_read_regs(*imu, BNO_ACC_DATA_X_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (int16_t)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read accelerometer data on Y-axis
 * ----------------------------------------------------------------------
 *
 * Reads the accelerometer data and stores the value in the specified buffer.
 * Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[float*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_acc_y(bno055_t* imu, float* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[2];
    if ((err = bno055_read_regs(*imu, BNO_ACC_DATA_Y_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (int16_t)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read accelerometer data on Z-axis
 * ----------------------------------------------------------------------
 *
 * Reads the accelerometer data and stores the value in the specified buffer.
 * Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[float*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_acc_z(bno055_t* imu, float* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[2];
    if ((err = bno055_read_regs(*imu, BNO_ACC_DATA_Z_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (int16_t)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read acceleration data on all axis
 * ----------------------------------------------------------------------
 *
 * Reads the acceleration data and stores the value in the specified
 * vector buffer. Unit can be specified with `bno055_set_unit(...)`. (Default:
 * m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[bno055_vec3_t*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_acc(bno055_t* imu, bno055_vec3_t* xyz) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[6];
    if ((err = bno055_read_regs(*imu, BNO_ACC_DATA_X_LSB, data, 6)) != BNO_OK) {
        return err;
    }
    float scale = (imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                           : BNO_ACC_SCALE_MG;
    xyz->x = (int16_t)((data[1] << 8) | data[0]) / scale;
    xyz->y = (int16_t)((data[3] << 8) | data[2]) / scale;
    xyz->z = (int16_t)((data[5] << 8) | data[4]) / scale;

    return BNO_OK;
};

/**
 * Bosch BNO055 read linear acceleration data on X-axis
 * ----------------------------------------------------------------------
 *
 * Reads the linear acceleration data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[float*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_linear_acc_x(bno055_t* imu, float* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[2];
    if ((err = bno055_read_regs(*imu, BNO_LIA_DATA_X_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (int16_t)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read linear acceleration data on Y-axis
 * ----------------------------------------------------------------------
 *
 * Reads the linear acceleration data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[float*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_linear_acc_y(bno055_t* imu, float* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[2];
    if ((err = bno055_read_regs(*imu, BNO_LIA_DATA_Y_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (int16_t)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read linear acceleration data on Z-axis
 * ----------------------------------------------------------------------
 *
 * Reads the linear acceleration data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[float*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_linear_acc_z(bno055_t* imu, float* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[2];
    if ((err = bno055_read_regs(*imu, BNO_LIA_DATA_Z_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (int16_t)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read linear acceleration data on all axis
 * ----------------------------------------------------------------------
 *
 * Reads the linear acceleration data and stores the value in the specified
 * vector buffer. Unit can be specified with `bno055_set_unit(...)`. (Default:
 * m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[bno055_vec3_t*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_linear_acc(bno055_t* imu, bno055_vec3_t* xyz) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[6];
    if ((err = bno055_read_regs(*imu, BNO_LIA_DATA_X_LSB, data, 6)) != BNO_OK) {
        return err;
    }
    float scale = (imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                           : BNO_ACC_SCALE_MG;
    xyz->x = (int16_t)((data[1] << 8) | data[0]) / scale;
    xyz->y = (int16_t)((data[3] << 8) | data[2]) / scale;
    xyz->z = (int16_t)((data[5] << 8) | data[4]) / scale;

    return BNO_OK;
};

/**
 * Bosch BNO055 read gyroscope data on X-axis
 * ----------------------------------------------------------------------
 *
 * Reads the gyroscope data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[float*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_gyro_x(bno055_t* imu, float* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[2];
    if ((err = bno055_read_regs(*imu, BNO_GYR_DATA_X_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (int16_t)((data[1] << 8) | data[0]) /
           ((imu->_gyr_unit == BNO_GYR_UNIT_DPS) ? BNO_GYR_SCALE_DPS
                                                 : BNO_GYR_SCALE_RPS);
    return BNO_OK;
};

/**
 * Bosch BNO055 read gyroscope data on Y-axis
 * ----------------------------------------------------------------------
 *
 * Reads the gyroscope data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[float*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_gyro_y(bno055_t* imu, float* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[2];
    if ((err = bno055_read_regs(*imu, BNO_GYR_DATA_Y_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (int16_t)((data[1] << 8) | data[0]) /
           ((imu->_gyr_unit == BNO_GYR_UNIT_DPS) ? BNO_GYR_SCALE_DPS
                                                 : BNO_GYR_SCALE_RPS);
    return BNO_OK;
};

/**
 * Bosch BNO055 read gyroscope data on Z-axis
 * ----------------------------------------------------------------------
 *
 * Reads the gyroscope data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[float*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_gyro_z(bno055_t* imu, float* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[2];
    if ((err = bno055_read_regs(*imu, BNO_GYR_DATA_Z_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (int16_t)((data[1] << 8) | data[0]) /
           ((imu->_gyr_unit == BNO_GYR_UNIT_DPS) ? BNO_GYR_SCALE_DPS
                                                 : BNO_GYR_SCALE_RPS);
    return BNO_OK;
};

/**
 * Bosch BNO055 read gyroscope data on all axis
 * ----------------------------------------------------------------------
 *
 * Reads the gyroscope data and stores the value in the specified
 * vector buffer. Unit can be specified with `bno055_set_unit(...)`. (Default:
 * m/s^2)
 *
 * FIX: MCU restart when moving
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[bno055_vec3_t*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_gyro(bno055_t* imu, bno055_vec3_t* xyz) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    uint8_t data[6];
    if ((err = bno055_read_regs(*imu, BNO_GYR_DATA_X_LSB, data, 6)) != BNO_OK) {
        return err;
    }

